In [1]:
import pandas as pd

In [2]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df = pd.read_csv('example')

In [4]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df.to_csv('my_output', index=False)

In [6]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
pd.read_excel('Excel_Sample.xlsx', sheetname='Sheet1')

TypeError: read_excel() got an unexpected keyword argument `sheetname`

In [8]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [9]:
df.to_excel('Excel_Sample_2.xlsx', sheet_name='NewSheet')

In [10]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [11]:
data

[                               Bank Name        City  ST   CERT  \
 0       City National Bank of New Jersey      Newark  NJ  21111
 1                          Resolute Bank      Maumee  OH  58317
 2                  Louisa Community Bank      Louisa  KY  58112
 3                   The Enloe State Bank      Cooper  TX  10716
 4    Washington Federal Bank for Savings     Chicago  IL  30570
 ..                                   ...         ...  ..    ...
 554                   Superior Bank, FSB    Hinsdale  IL  32646
 555                  Malta National Bank       Malta  OH   6629
 556      First Alliance Bank & Trust Co.  Manchester  NH  34264
 557    National State Bank of Metropolis  Metropolis  IL   3815
 558                     Bank of Honolulu    Honolulu  HI  21029

                    Acquiring Institution       Closing Date       Updated Date
 0                        Industrial Bank   November 1, 2019  December 19, 2019
 1                     Buckeye State Bank   October 25, 2019  December 19, 2019
 2      Kentucky Farmers Bank Corporation   October 25, 2019  December 19, 2019
 3                     Legend Bank, N. A.       May 31, 2019  December 19, 2019
 4                     Royal Savings Bank  December 15, 2017      July 24, 2019
 ..                                   ...                ...                ...
 554                Superior Federal, FSB      July 27, 2001    August 19, 2014
 555                    North Valley Bank        May 3, 2001  November 18, 2002
 556  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
 557              Banterra Bank of Marion  December 14, 2000     March 17, 2005
 558                   Bank of the Orient   October 13, 2000     March 17, 2005

 [559 rows x 7 columns]]

In [12]:
type(data)

list

In [14]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","December 19, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","December 19, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","December 19, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","December 19, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

In [15]:
from sqlalchemy import create_engine

In [17]:
engine = create_engine('sqlite:///:memory:')

In [18]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
df.to_sql('my_table', engine)

In [20]:
sqldf = pd.read_sql('my_table', con=engine)

In [21]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15